## 1) Leia o arquivo lemonades.csv usando pandas.

In [99]:
import pandas as pd
lemonades = pd.read_csv('Lemonades.csv', sep = ";")

lemonades.head(n=10)

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
0  07/01/2016     Park     97      67           70      90.0   0.25
1  07/02/2016     Park     98      67           72      90.0   0.25
2  07/03/2016     Park    110      77           71     104.0   0.25
3  07/04/2016    Beach    134      99           76      98.0   0.25
4  07/05/2016    Beach    159     118           78     135.0   0.25
5  07/06/2016    Beach    103      69           82      90.0   0.25
6  07/06/2016    Beach    103      69           82      90.0   0.25
7  07/07/2016    Beach    143     101           81     135.0   0.25
8         NaN    Beach    123      86           82     113.0   0.25
9  07/09/2016    Beach    134      95           80     126.0   0.25

## 2) Retorne as informações sobre as colunas e as principais estatísticas sobre o dataset.

In [100]:
lemonades.describe()

            Lemon      Orange  Temperature    Leaflets      Price
count   32.000000   32.000000    32.000000   31.000000  32.000000
mean   116.156250   80.000000    78.968750  108.548387   0.354688
std     25.823357   21.863211     4.067847   20.117718   0.113137
min     71.000000   42.000000    70.000000   68.000000   0.250000
25%     98.000000   66.750000    77.000000   90.000000   0.250000
50%    113.500000   76.500000    80.500000  108.000000   0.350000
75%    131.750000   95.000000    82.000000  124.000000   0.500000
max    176.000000  129.000000    84.000000  158.000000   0.500000

In [101]:
lemonades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 7 columns):
Date           31 non-null object
Location       32 non-null object
Lemon          32 non-null int64
Orange         32 non-null int64
Temperature    32 non-null int64
Leaflets       31 non-null float64
Price          32 non-null float64
dtypes: float64(2), int64(3), object(2)
memory usage: 1.9+ KB

In [102]:
lemonades.dtypes

Date            object
Location        object
Lemon            int64
Orange           int64
Temperature      int64
Leaflets       float64
Price          float64
dtype: object

## 3) Realize a limpeza do dataset
### a) verifique se existe valores nulos

In [103]:
lemonades.isna().sum()

Date           1
Location       0
Lemon          0
Orange         0
Temperature    0
Leaflets       1
Price          0
dtype: int64

### b) verifique e remova, se existir, linhas duplicadas

In [104]:
lemonades[lemonades.duplicated()]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
6  07/06/2016    Beach    103      69           82      90.0   0.25

In [105]:
lemonades = lemonades.drop_duplicates()

In [106]:
lemonades[lemonades.duplicated()]

Empty DataFrame
Columns: [Date, Location, Lemon, Orange, Temperature, Leaflets, Price]
Index: []

### c) trate os elementos faltantes (interpolação (data) e media)

In [107]:
lemonades['Date'] = pd.to_datetime(lemonades['Date'])
lemonades.dtypes

Date           datetime64[ns]
Location               object
Lemon                   int64
Orange                  int64
Temperature             int64
Leaflets              float64
Price                 float64
dtype: object

In [108]:
import numpy as np

t0 = lemonades['Date'].min()
m = lemonades.Date.notnull()
lemonades.loc[m, 'Date_int'] = (lemonades.loc[m, 'Date'] - t0).dt.total_seconds()
lemonades['Date'] = np.datetime64(t0) + pd.to_timedelta(lemonades.Date_int.interpolate(), unit='s')
del lemonades['Date_int']
lemonades.isna().sum()

Date           0
Location       0
Lemon          0
Orange         0
Temperature    0
Leaflets       1
Price          0
dtype: int64

In [109]:
lemonades['Leaflets'].fillna((lemonades['Leaflets'].mean()), inplace=True)
lemonades.isna().sum()

Date           0
Location       0
Lemon          0
Orange         0
Temperature    0
Leaflets       0
Price          0
dtype: int64

## 4) Adicione uma coluna chamada "Sales" que contém o total de vendas de limão e laranja

In [110]:
lemonades["Sales"] = lemonades["Lemon"] + lemonades["Orange"]
lemonades.head()

        Date Location  Lemon  Orange  Temperature  Leaflets  Price  Sales
0 2016-07-01     Park     97      67           70      90.0   0.25    164
1 2016-07-02     Park     98      67           72      90.0   0.25    165
2 2016-07-03     Park    110      77           71     104.0   0.25    187
3 2016-07-04    Beach    134      99           76      98.0   0.25    233
4 2016-07-05    Beach    159     118           78     135.0   0.25    277

## 5) Adicione uma coluna chamada "Revenue" que calcula o lucro (venda*preço)

In [111]:
lemonades["Revenue"] = lemonades["Sales"] * lemonades["Price"]
lemonades.head()

,Date,Location,Lemon,Orange,Temperature,Leaflets,Price,Sales,Revenue
0,2016-07-01,Park,97,67,70,90.0,0.25,164,41.00
1,2016-07-02,Park,98,67,72,90.0,0.25,165,41.25
2,2016-07-03,Park,110,77,71,104.0,0.25,187,46.75
3,2016-07-04,Beach,134,99,76,98.0,0.25,233,58.25
4,2016-07-05,Beach,159,118,78,135.0,0.25,277,69.25

## 6) Escreva uma função que retorne o lucro total

In [112]:
def total_revenue(df):
    return df["Revenue"].sum()
    
total_revenue(lemonades)

2138.0

## 7) Escreva uma função que receba dois parâmetros, dataset e temp(int). Se temp for 1, ele retorna a máxima temperatura observada no conjunto de dados; se 0, retorna a média do período observado; se -1, retorna a temperatura mínima.

In [113]:
def funcao_temp(dataset, temp):
    if(temp == 1):
        return dataset["Temperature"].max()
    elif(temp == 0):
        return dataset["Temperature"].mean()
    elif(temp == -1):
        return dataset["Temperature"].min()
    
print(funcao_temp(lemonades, -1))
print(funcao_temp(lemonades, 0))
print(funcao_temp(lemonades, 1))

70
78.87096774193549
84

## 8) Escreva uma função que receba dois parâmetros (dataset, localização) e retorne o dataset com o preço do limão e laranja ajustados em 15% se a localização for 'Park' ou ajustados em 10% se a localização for 'Beach'.

In [114]:
def get_adjusted_price(dataset, location):
    multiplier = 1.10 if location == "Beach" else 1.15 if location == "Park" else 1
    dataset[["Lemon", "Orange"]] = dataset[["Lemon", "Orange"]] * multiplier
    return dataset
        
print(get_adjusted_price(lemonades, "Beach").head())
print(get_adjusted_price(lemonades, "Park").head())

   Lemon  Orange
0  106.7    73.7
1  107.8    73.7
2  121.0    84.7
3  147.4   108.9
4  174.9   129.8
    Lemon  Orange
0  111.55   77.05
1  112.70   77.05
2  126.50   88.55
3  154.10  113.85
4  182.85  135.70